FreeRTOS/FreeRTOS/FreeRTOS/Demo/RL78_E2Studio_GCC/src/iodefine/iodefine_RL78L13_ext.h
#define TKBTRG0_bit (*(volatile union un_tkbtrg0 *)0xF0512).BIT
#define TKBFLG0 (*(volatile union un_tkbflg0 *)0xF0513).tkbflg0
#define TKBFLG0_bit (*(volatile union un_tkbflg0 *)0xF0513).BIT
#define TKBCRLD00 (*(volatile unsigned short *)0xF0514)
#define TKBCRLD01 (*(volatile unsigned short *)0xF0516)
#define TKBCNT0 (*(volatile unsigned short *)0xF0520)
#define TKBCTL00 (*(volatile unsigned short *)0xF0522)
#define TKBMFR0 (*(volatile unsigned short *)0xF0524)
#define TKBIOC00 (*(volatile union un_tkbioc00 *)0xF0526).tkbioc00
#define TKBIOC00_bit (*(volatile union un_tkbioc00 *)0xF0526).BIT
#define TKBCLR0 (*(volatile union un_tkbclr0 *)0xF0527).tkbclr0
#define TKBCLR0_bit (*(volatile union un_tkbclr0 *)0xF0527).BIT
#define TKBIOC01 (*(volatile union un_tkbioc01 *)0xF0528).tkbioc01
#define TKBIOC01_bit (*(volatile union un_tkbioc01 *)0xF0528).BIT
#define TKBCTL01 (*(volatile union un_tkbctl01 *)0xF0529).tkbctl01
#define TKBCTL01_bit (*(volatile union un_tkbctl01 *)0xF0529).BIT
#define TKBPSCS0 (*(volatile unsigned char *)0xF052A)
#define TKBPACTL00 (*(volatile unsigned short *)0xF0530)
#define TKBPACTL01 (*(volatile unsigned short *)0xF0532)
#define TKBPAHFS0 (*(volatile union un_tkbpahfs0 *)0xF0534).tkbpahfs0
#define TKBPAHFS0_bit (*(volatile union un_tkbpahfs0 *)0xF0534).BIT
#define TKBPAHFT0 (*(volatile union un_tkbpahft0 *)0xF0535).tkbpahft0
#define TKBPAHFT0_bit (*(volatile union un_tkbpahft0 *)0xF0535).BIT
#define TKBPAFLG0 (*(volatile union un_tkbpaflg0 *)0xF0536).tkbpaflg0
#define TKBPAFLG0_bit (*(volatile union un_tkbpaflg0 *)0xF0536).BIT
#define TKBPACTL02 (*(volatile union un_tkbpactl02 *)0xF0537).tkbpactl02
#define TKBPACTL02_bit (*(volatile union un_tkbpactl02 *)0xF0537).BIT

/*
 Sfr bits
 */
#define ADTYP ADM2_bit.no0
#define AWC ADM2_bit.no2
#define ADRCK ADM2_bit.no3
#define TOS0 TOS_bit.no0
#define TKB2EN PER1_bit.no4
#define CMPEN PER1_bit.no5
#define TMKAEN PER1_bit.no7
#define DFLEN DFLCTL_bit.no0
#define FSUBEN PERZ_bit.no7
#define BRSAM BECTL_bit.no0
#define ESQST FSSE_bit.no7
#define DIVST MDUC_bit.no0
#define MACSF MDUC_bit.no1
#define MACOF MDUC_bit.no2
#define MDSM MDUC_bit.no3
#define MACMODE MDUC_bit.no6
#define DIVMODE MDUC_bit.no7
#define TAU0EN PER0_bit.no0
#define SAU0EN PER0_bit.no2
#define SAU1EN PER0_bit.no3
#define IICA0EN PER0_bit.no4
#define ADCEN PER0_bit.no5
#define RTCWEN PER0_bit.no7
#define PAENB RMC_bit.no0
#define WDVOL RMC_bit.no7
#define RPEF RPECTL_bit.no0
#define RPERDIS RPECTL_bit.no7
#define DWAIT2 DMC2_bit.no4
#define DS2 DMC2_bit.no5
#define DRS2 DMC2_bit.no6
#define STG2 DMC2_bit.no7
#define DWAIT3 DMC3_bit.no4
#define DS3 DMC3_bit.no5
#define DRS3 DMC3_bit.no6
#define STG3 DMC3_bit.no7
#define DST2 DRC2_bit.no0
#define DEN2 DRC2_bit.no7
#define DST3 DRC3_bit.no0
#define DEN3 DRC3_bit.no7
#define DWAITALL0 DWAITALL_bit.no0
#define PRVARI DWAITALL_bit.no7
#define SPT0 IICCTL00_bit.no0
#define STT0 IICCTL00_bit.no1
#define ACKE0 IICCTL00_bit.no2
#define WTIM0 IICCTL00_bit.no3
#define SPIE0 IICCTL00_bit.no4
#define WREL0 IICCTL00_bit.no5
#define LREL0 IICCTL00_bit.no6
#define IICE0 IICCTL00_bit.no7
#define PRS0 IICCTL01_bit.no0
#define DFC0 IICCTL01_bit.no2
#define SMC0 IICCTL01_bit.no3
#define DAD0 IICCTL01_bit.no4
#define CLD0 IICCTL01_bit.no5
#define WUP0 IICCTL01_bit.no7
#define CRC0EN CRC0CTL_bit.no7
#define C0ENB COMPMDR_bit.no0
#define C0MON COMPMDR_bit.no3
#define C1ENB COMPMDR_bit.no4
#define C1MON COMPMDR_bit.no7
#define C0IE COMPOCR_bit.no0
#define C0OE COMPOCR_bit.no1
#define C0OP COMPOCR_bit.no2
#define C1IE COMPOCR_bit.no4
#define C1OE COMPOCR_bit.no5
#define C1OP COMPOCR_bit.no6
#define SPDMD COMPOCR_bit.no7
#define TKBRDT0 TKBTRG0_bit.no0
#define TKBRSF0 TKBFLG0_bit.no0
#define TKBMFF0 TKBFLG0_bit.no1
#define TKBIEF0 TKBFLG0_bit.no2
#define TKBIRF0 TKBFLG0_bit.no3
#define TKBSEF00 TKBFLG0_bit.no4
#define TKBSEF01 TKBFLG0_bit.no5
#define TKBSSF00 TKBFLG0_bit.no6
#define TKBSSF01 TKBFLG0_bit.no7
#define TKBTOD00 TKBIOC00_bit.no0
#define TKBTOD01 TKBIOC00_bit.no1
#define TKBTOL00 TKBIOC00_bit.no2
#define TKBTOL01 TKBIOC00_bit.no3
#define TKBCLMF0 TKBCLR0_bit.no1
#define TKBCLIE0 TKBCLR0_bit.no2
#define TKBCLIR0 TKBCLR0_bit.no3
#define TKBCLSE00 TKBCLR0_bit.no4
#define TKBCLSE01 TKBCLR0_bit.no5
#define TKBTOE00 TKBIOC01_bit.no0
#define TKBTOE01 TKBIOC01_bit.no1
#define TKBCE0 TKBCTL01_bit.no7
#define TKBPAHTS00 TKBPAHFS0_bit.no0
#define TKBPAHTS01 TKBPAHFS0_bit.no1
#define TKBPAHTT00 TKBPAHFT0_bit.no0
#define TKBPAHTT01 TKBPAHFT0_bit.no1
#define TKBPAHIF00 TKBPAFLG0_bit.no0
#define TKBPAFIF00 TKBPAFLG0_bit.no1
#define TKBPAHIF01 TKBPAFLG0_bit.no2
#define TKBPAFIF01 TKBPAFLG0_bit.no3
#define TKBPAHSF00 TKBPAFLG0_bit.no4
#define TKBPAFSF00 TKBPAFLG0_bit.no5
#define TKBPAHSF01 TKBPAFLG0_bit.no6
#define TKBPAFSF01 TKBPAFLG0_bit.no7
#define TKBPACE00 TKBPACTL02_bit.no0
#define TKBPACE01 TKBPACTL02_bit.no1

/*
 Interrupt vector addresses
 */
#endif
